[BU_ResistanceMec X2CharacterTemplate]
strCharacterName="Resistance MEC"
strCharacterHealingPaused="Repairs Required"

[BU_MecArcher X2CharacterTemplate]
strCharacterName="MEC Archer"
strCharacterHealingPaused="Repairs Required"

[BU_MecPyroclast X2CharacterTemplate]
strCharacterName="MEC Pyroclast"
strCharacterHealingPaused="Repairs Required"

[BU_JunkSpark X2CharacterTemplate]
strCharacterName="Junk SPARK"
strCharacterHealingPaused="Repairs Required"

[BU_AdventDrone X2CharacterTemplate]
strCharacterName="Advent Drone"
strCharacterHealingPaused="Repairs Required"

[BU_EnigmaDrone X2CharacterTemplate]
strCharacterName="Enigma Drone"
strCharacterHealingPaused="Repairs Required"

[BU_HunterDrone X2CharacterTemplate]
strCharacterName="Hunter Drone"
strCharacterHealingPaused="Repairs Required"

[BU_PhaseDrone X2CharacterTemplate]
strCharacterName="Phase Drone"
strCharacterHealingPaused="Repairs Required"

[BU_CelatidTurretCV X2CharacterTemplate]
strCharacterName="Celatid Turret"

[BU_CelatidTurretMG X2CharacterTemplate]
strCharacterName="Alloy Celatid Turret"

[BU_CelatidTurretBM X2CharacterTemplate]
strCharacterName="Elerium Celatid Turret"

[BU_Shiv X2CharacterTemplate]
strCharacterName="SHIV"
strCharacterHealingPaused="Repairs Required"

[BU_AlloyShiv X2CharacterTemplate]
strCharacterName="Alloy SHIV"
strCharacterHealingPaused="Repairs Required"

[BU_EleriumShiv X2CharacterTemplate]
strCharacterName="Elerium SHIV"
strCharacterHealingPaused="Repairs Required"

[BU_FrostMec X2CharacterTemplate]
strCharacterName="Frost MEC"
strCharacterHealingPaused="Repairs Required"

[BU_FrostDroid X2CharacterTemplate]
strCharacterName="Frost Droid"
strCharacterHealingPaused="Repairs Required"

[BU_PrototypeGatlingMec X2CharacterTemplate]
strCharacterName="Prototype Assault MEC"
strCharacterHealingPaused="Repairs Required"

[BU_MilitaryGatlingMec X2CharacterTemplate]
strCharacterName="Military Assault MEC"
strCharacterHealingPaused="Repairs Required"

[BU_ResistanceMec_Tech X2TechTemplate]
DisplayName="Resistance MEC"
Summary="Build a Resistance MEC to add to our barracks. They can't rank up or hack, nor can we improve their equipment, but they can still help bolster our numbers for little cost. If one is destroyed in combat, we may be able to recover its wreck, but all other resources that went into its construction will be lost."
CodeName="Clanker"
LongDescript="Unlike the MECs we find or hijack in the field, the Resistance MECs built on the Avenger stay on the Avenger and can be deployed like normal soldiers. They can't rank up or hack, nor can we improve their equipment, but they can still help bolster our numbers. If one is destroyed in combat, we may be able to recover its wreck, but all other resources will be lost."

[BU_MecArcher_Tech X2TechTemplate]
DisplayName="MEC Archer"
Summary="Build a MEC Archer to add to our barracks. Compared to the Resistance MEC, they are less durable, but hold three times as many micro missiles and can fire them twice as far. They can't rank up or hack, nor can we improve their equipment, but they can still help bolster our numbers for little cost. If one is destroyed in combat, we may be able to recover its wreck, but all other resources that went into its construction will be lost."
CodeName="Arrow"
LongDescript="They can't rank up or hack, nor can we improve their equipment, but they can still help bolster our numbers. If one is destroyed in combat, we may be able to recover its wreck, but all other resources will be lost."

[BU_MecPyroclast_Tech X2TechTemplate]
DisplayName="MEC Pyroclast"
Summary="Build a MEC Pyroclast to add to our barracks. They carry a specialized flamethrower variant with two firing modes. Compared to the Resistance MEC, they are more durable and mobile, but their lack of micro missiles or an orthodox firearm limit their flexibility. They can't rank up or hack, nor can we improve their equipment, but they can still help bolster our numbers for little cost. If one is destroyed in combat, we may be able to recover its wreck, but all other resources that went into its construction will be lost."
CodeName="Vulkan"
LongDescript="They can't rank up or hack, nor can we improve their equipment, but they can still help bolster our numbers. If one is destroyed in combat, we may be able to recover its wreck, but all other resources will be lost."

[BU_JunkSpark_Tech X2TechTemplate]
DisplayName="Junk SPARK"
Summary="Build a Junk SPARK to add to our barracks, out of only the cheapest parts. They can't rank up or hack, nor can we improve their equipment, but they can still help bolster our numbers for very little cost. They are so cheaply made that if one is destroyed in combat, we won't be able to recover any resources used to make it."
CodeName="Rusty"
LongDescript="They can't rank up or hack, nor can we improve their equipment, but they can still help bolster our numbers for little cost. They are so cheaply made that if one is destroyed in combat, we won't be able to recover any resources used to make it."

[BU_AdventDrone_Tech X2TechTemplate]
DisplayName="Advent Drone"
Summary="Build an Advent Drone to add to our barracks. They can't rank up or hack, nor can we improve their equipment, but they can still help bolster our numbers for little cost. If one is destroyed in combat, we may be able to recover its wreck, but all other resources that went into its construction will be lost. Unlike humanoid robotics, this drone lacks limbs, preventing it from picking up loot or marking supply crates."
CodeName="Eyebot"
LongDescript="They can't rank up or hack, nor can we improve their equipment, but they can still help bolster our numbers. If one is destroyed in combat, we may be able to recover its wreck, but all other resources will be lost."

[BU_HunterDrone_Tech X2TechTemplate]
DisplayName="Hunter Drone"
Summary="Build a Hunter Drone to add to our barracks. This model features improved durability, damage, and repair capabilities compared to the standard Advent Drone. They can't rank up or hack, nor can we improve their equipment, but they can still help bolster our numbers for little cost. If one is destroyed in combat, we may be able to recover its wreck, but all other resources that went into its construction will be lost. Unlike humanoid robotics, this drone lacks limbs, preventing it from picking up loot or marking supply crates."
CodeName="ED-E"
LongDescript="They can't rank up or hack, nor can we improve their equipment, but they can still help bolster our numbers. If one is destroyed in combat, we may be able to recover its wreck, but all other resources will be lost."

[BU_EnigmaDrone_Tech X2TechTemplate]
DisplayName="Enigma Drone"
Summary="Build an Enigma Drone to add to our barracks. Compared to the Advent Drone, they have an easier time avoiding attacks, slightly improved durability and effectiveness with repairs and shock beam damage. Although they cannot use the signature Drone Stunner, they can mark targets to increase the squad's accuracy against them. Additionally, they have improved stealth capabilities by being able to remain in concealment even if the squad is not, and can re-enter concealment once per mission. They can't rank up or hack, nor can we improve their equipment, but they can still help bolster our numbers for little cost. If one is destroyed in combat, we may be able to recover its wreck, but all other resources that went into its construction will be lost. Unlike humanoid robotics, this drone lacks limbs, preventing it from picking up loot or marking supply crates."
CodeName="Shade"
LongDescript="They can't rank up or hack, nor can we improve their equipment, but they can still help bolster our numbers. If one is destroyed in combat, we may be able to recover its wreck, but all other resources will be lost."

[BU_PhaseDrone_Tech X2TechTemplate]
DisplayName="Phase Drone"
Summary="Build a Phase Drone to add to our barracks. They're equipped with a blaster that doesn't require manual reloading and a single micro missile, and can also mark targets and move through walls. Much like other drones, Phase Drones can see further than regular units can. Unlike regular drones, they can fire their primary weapon as far as they can see. They can't rank up or hack, nor can we improve their equipment, but they can still help bolster our numbers for little cost. If one is destroyed in combat, we may be able to recover its wreck, but all other resources that went into its construction will be lost. Unlike humanoid robotics, this drone lacks limbs, preventing it from picking up loot or marking supply crates."
CodeName="Ghost"
LongDescript="They can't rank up or hack, nor can we improve their equipment, but they can still help bolster our numbers. If one is destroyed in combat, we may be able to recover its wreck, but all other resources will be lost."

[BU_CelatidTurretCV_Tech X2TechTemplate]
DisplayName="Celatid Turret"
Summary="Build a Celatid Turret to add to our barracks, armed with a conventional gun that doesn't require manual reloading. They can fire a standard shot without ending their turn. Additionally, they can fire a shot that can immobilize a target for a turn. Although we call them turrets, they're perfectly capable of moving around the battlefield like a drone can. The Celatid Turret is biomechanical, just like a MEC Trooper, and offers solid firepower and durability relative to its size. While they can be targeted by Psionics and set on fire, as well as requiring time to heal from injuries and recover from fatigue, they are immune to stun as well as most types of poison. They can't rank up or hack, nor can we improve their equipment, but they can still help bolster our numbers for little cost. If one is destroyed in combat, we may be able to recover its corpse, but all other resources that went into its construction will be lost. Contrary to the typical hovering non-humanoid units, this one has short limbs at the front that work well enough for picking up loot or marking supply crates."
CodeName="Worm"
LongDescript="They can't rank up or hack, nor can we improve their equipment, but they can still help bolster our numbers. If one is destroyed in combat, we may be able to recover its corpse, but all other resources will be lost."

[BU_CelatidTurretMG_Tech X2TechTemplate]
DisplayName="Alloy Celatid Turret"
Summary="Build an Alloy Celatid Turret to add to our barracks, armed with a magnetic gun that doesn't require manual reloading. The improved materials in the mechanical parts grant it better control of its turret, granting it the Ever Vigilant ability in addition to the abilities of the standard variant. Although we call them turrets, they're perfectly capable of moving around the battlefield like a drone can. The Alloy Celatid Turret is biomechanical, just like a MEC Trooper, and offers solid firepower and durability relative to its size. While they can be targeted by Psionics and set on fire, as well as requiring time to heal from injuries and recover from fatigue, they are immune to stun as well as most types of poison. They can't rank up or hack, nor can we improve their equipment, but they can still help bolster our numbers for little cost. If one is destroyed in combat, we may be able to recover its corpse, but all other resources that went into its construction will be lost. Contrary to the typical hovering non-humanoid units, this one has short limbs at the front that work well enough for picking up loot or marking supply crates."
CodeName="Cocoon"
LongDescript="They can't rank up or hack, nor can we improve their equipment, but they can still help bolster our numbers. If one is destroyed in combat, we may be able to recover its corpse, but all other resources will be lost."

[BU_CelatidTurretBM_Tech X2TechTemplate]
DisplayName="Elerium Celatid Turret"
Summary="Build an Elerium Celatid Turret to add to our barracks, armed with a beam gun that doesn't require manual reloading. The further improved materials in the mechanical parts grant it even better control of its turret, granting it the Ever Vigilant and Return Fire abilities in addition to the abilities of the standard variant. Although we call them turrets, they're perfectly capable of moving around the battlefield like a drone can. The Elerium Celatid Turret is biomechanical, just like a MEC Trooper, and offers solid firepower and durability relative to its size. While they can be targeted by Psionics and set on fire, as well as requiring time to heal from injuries and recover from fatigue, they are immune to stun as well as most types of poison. They can't rank up or hack, nor can we improve their equipment, but they can still help bolster our numbers for little cost. If one is destroyed in combat, we may be able to recover its corpse, but all other resources that went into its construction will be lost. Contrary to the typical hovering non-humanoid units, this one has short limbs at the front that work well enough for picking up loot or marking supply crates."
CodeName="Wingless"
LongDescript="They can't rank up or hack, nor can we improve their equipment, but they can still help bolster our numbers. If one is destroyed in combat, we may be able to recover its corpse, but all other resources will be lost."

[BU_Shiv_Tech X2TechTemplate]
DisplayName="SHIV"
Summary="Build a SHIV (Super Heavy Infantry Vehicle) to add to our barracks. Since SHIVs are entirely our own technology, it was simple enough to make them compatible with our standard GREMLINs. Each SHIV comes with its own GREMLIN companion, which will shut down if the SHIV is destroyed in combat. We've programmed in the Aid Protocol and Scanning Protocol abilities, but the SHIV's OS isn't advanced enough to compensate for the lack of a skilled hacker during the hacking process, so the hacking feature wasn't implemented. They can't rank up, nor can we improve their equipment, but they can still help bolster our numbers for little cost. If one is destroyed in combat, we won't be able to recover anything. Unlike humanoid robotics, the SHIV lacks limbs, preventing it from picking up loot or marking supply crates."
CodeName="Rolling"
LongDescript="They can't rank up or hack, nor can we improve their equipment, but they can still help bolster our numbers. There will be nothing left to recover if it is destroyed in combat."

[BU_AlloyShiv_Tech X2TechTemplate]
DisplayName="Alloy SHIV"
Summary="Build an Alloy SHIV (Super Heavy Infantry Vehicle) to add to our barracks. They have a laser weapon, they boast higher durability than a standard SHIV and have the ability to provide full cover to adjacent soldiers. As the Alloy SHIV is built using the basic SHIV as a template, it was simple enough to make them compatible with our standard GREMLINs. Each Alloy SHIV comes with its own GREMLIN companion, which will shut down if the Alloy SHIV is destroyed in combat. In addition to the basic functions shared with the basic SHIV, the Alloy SHIV's bulk allowed us room for a hardware upgrade, granting the Threat Assessment ability, although they still cannot hack Advent systems. They can't rank up, nor can we improve their equipment, but they can still help bolster our numbers for little cost. If one is destroyed in combat, we won't be able to recover anything. Unlike humanoid robotics, the Alloy SHIV lacks limbs, preventing it from picking up loot or marking supply crates."
CodeName="Gargoyle"
LongDescript="They can't rank up or hack, nor can we improve their equipment, but they can still help bolster our numbers. There will be nothing left to recover if it is destroyed in combat."

[BU_EleriumShiv_Tech X2TechTemplate]
DisplayName="Elerium SHIV"
Summary="Build an Elerium SHIV (Super Heavy Infantry Vehicle) to add to our barracks. They have a coil weapon which is powerful enough to demolish enemy cover, they boast higher durability than an Alloy SHIV and retain the ability to provide full cover to adjacent soldiers. As the Elerium SHIV is built using the basic SHIV as a template, it was simple enough to make them compatible with our standard GREMLINs. Each Elerium SHIV comes with its own GREMLIN companion, which will shut down if the Elerium SHIV is destroyed in combat. In addition to the basic and advanced functions shared with the Alloy SHIV, the Elerium SHIV's superior materials left even more space for hardware upgrades, granting the Capacitor Discharge and Automend Shield abilities, although they still cannot hack Advent systems. They can't rank up, nor can we improve their equipment, but they can still help bolster our numbers for little cost. If one is destroyed in combat, we won't be able to recover anything. Unlike humanoid robotics, the Elerium SHIV lacks limbs, preventing it from picking up loot or marking supply crates."
CodeName="Colossus"
LongDescript="They can't rank up or hack, nor can we improve their equipment, but they can still help bolster our numbers. There will be nothing left to recover if it is destroyed in combat."

[BU_FrostMec_Tech X2TechTemplate]
DisplayName="Frost MEC"
Summary="Build a Frost MEC to add to our barracks, which can inflict bitterfrost with its cannon and micro missiles. They can't rank up or hack, nor can we improve their equipment, but they can still help bolster our numbers for little cost. If one is destroyed in combat, we may be able to recover its wreck, but all other resources that went into its construction will be lost."
CodeName="Abominable"
LongDescript="They can't rank up or hack, nor can we improve their equipment, but they can still help bolster our numbers. If one is destroyed in combat, we may be able to recover its wreck, but all other resources will be lost."

[BU_FrostDroid_Tech X2TechTemplate]
DisplayName="Frost Droid"
Summary="Build a Frost Droid to add to our barracks, which can inflict bitterfrost with its pistol, and equip any of our human soldiers' primary weapons. It will have different abilities in battle based on its primary weapon. It can also perform certain actions that no other robots can, like carrying unconscious units, taking cover and hunkering down. They can't rank up or hack, nor can we improve their armor or pistol, but they can still help bolster our numbers for little cost. If one is destroyed in combat, we won't be able to recover any of the resources used to build it."
CodeName="Second String"
LongDescript="They can't rank up or hack, nor can we improve their armor or pistol, but they can still help bolster our numbers. If one is destroyed in combat, we may be able to recover its wreck, but all other resources will be lost."

[BU_PrototypeGatlingMec_Tech X2TechTemplate]
DisplayName="Prototype Assault MEC"
Summary="Build a Prototype Assault MEC, armed with a shotgun and gatling cannon, to add to our barracks. They can't rank up or hack, nor can we improve their equipment, but they can still help bolster our numbers for little cost. If one is destroyed in combat, we may be able to recover its wreck, but all other resources that went into its construction will be lost."
CodeName="Blues"
LongDescript="They can't rank up or hack, nor can we improve their equipment, but they can still help bolster our numbers. If one is destroyed in combat, we may be able to recover its wreck, but all other resources will be lost."

[BU_MilitaryGatlingMec_Tech X2TechTemplate]
DisplayName="Military Assault MEC"
Summary="Build a Military Assault MEC, armed with a shotgun and gatling cannon, to add to our barracks. This model is a straight upgrade to the Prototype variant in terms of both durability and power, and also have had AI improvements allowing them to use their shotgun for a reaction attack at close range during enemy turns. They can't rank up or hack, nor can we improve their equipment, but they can still help bolster our numbers for little cost. If one is destroyed in combat, we may be able to recover its wreck, but all other resources that went into its construction will be lost."
CodeName="Rock"
LongDescript="They can't rank up or hack, nor can we improve their equipment, but they can still help bolster our numbers. If one is destroyed in combat, we may be able to recover its wreck, but all other resources will be lost."

[BU_StartingShiv1_Tech X2TechTemplate]
DisplayName="Activate Recovered SHIV Unit"
Summary="During one of our equipment salvaging runs prior to your recovery, Commander, we managed to find two old SHIV units that needed only minor repairs and resupplying to restore to combat readiness. We've also integrated jump jets and compatibility with our basic GREMLIN units. This is the first of the two SHIV units. All that's needed at this point is your approval, and it will be activated and added to the barracks."
CodeName="First Relic"
LongDescript="SHIVs can't rank up or hack, nor can we improve their equipment, but they can still help bolster our numbers. There will be nothing left to recover if it is destroyed in combat."

[BU_StartingShiv2_Tech X2TechTemplate]
DisplayName="Activate Recovered SHIV Unit"
Summary="This is the second of the two SHIV units we recovered. All that's needed at this point is your approval, and it will be activated and added to the barracks. If you want more SHIV units, they will need to be built from scratch, which will require a bigger space for our Engineering team to work with. As our research advances, we may be able to create a new type of SHIV, or even entirely different units to support our soldiers."
CodeName="Second Relic"
LongDescript="SHIVs can't rank up or hack, nor can we improve their equipment, but they can still help bolster our numbers. There will be nothing left to recover if it is destroyed in combat."

[BU_ResistanceMec_WPN X2WeaponTemplate]
FriendlyName="MEC Cannon"
FriendlyNamePlural="MEC Cannons"
BriefSummary="A powerful but physically-heavy cannon designed specifically for use by our Resistance MEC units. Does not allow for modifications."
TacticalText="<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training."
AbilityDescName="MEC cannon"

[BU_MecArcher_WPN X2WeaponTemplate]
FriendlyName="MEC MiniMag"
FriendlyNamePlural="MEC MiniMags"
BriefSummary="The MEC Archer's primary weapon. Has less damage potential than the MEC Cannon, but features a larger magazine well-suited for suppressing targets. Does not allow for modifications."
TacticalText="<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training."
AbilityDescName="MEC minimag"

[BU_FrostMec_WPN X2WeaponTemplate]
FriendlyName="Frost MEC Cannon"
FriendlyNamePlural="Frost MEC Cannons"
BriefSummary="A cannon designed specifically for use by our Frost MEC units. Deals slightly less max damage than a Resistance MEC's cannon and does not shred armor, but inflicts bitterfrost on a hit and pierces some armor. Does not allow for modifications."
TacticalText="<Bullet/> Inflicts bitterfrost on a hit.\n<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training."
AbilityDescName="Frost MEC cannon"

[BU_MecPyroclast_WPN X2WeaponTemplate]
FriendlyName="MEC Flame Projector"
FriendlyNamePlural="MEC Flame Projectors"
BriefSummary="The MEC Pyroclast's primary weapon, which allows it to spray flames over a cone-shaped area. Magazine size is bigger than average, but cannot use Overwatch. Does not allow for modifications."
TacticalText="<Bullet/> The standard firing mode can be used without ending the turn."
AbilityDescName="MEC flame projector"

[BU_PrototypeGatlingMec_WPN X2WeaponTemplate]
FriendlyName="Prototype MEC Shotgun"
FriendlyNamePlural="Prototype MEC Shotguns"
BriefSummary="A powerful but physically-heavy shotgun designed specifically for use by our Prototype Assault MEC units. Does not allow for modifications or Overwatch."
TacticalText="<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training."
AbilityDescName="Prototype MEC shotgun"

[BU_MilitaryGatlingMec_WPN X2WeaponTemplate]
FriendlyName="Military MEC Shotgun"
FriendlyNamePlural="Military MEC Shotguns"
BriefSummary="A powerful but physically-heavy shotgun designed specifically for use by our Military Assault MEC units. Does not allow for modifications or Overwatch."
TacticalText="<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training."
AbilityDescName="Military MEC shotgun"

[BU_ResistanceMEC_Shoulder_WPN X2WeaponTemplate]
FriendlyName="Micro Missile Launcher"
FriendlyNamePlural="Micro Missile Launchers"
BriefSummary="A long-range, shoulder-mounted launcher that deals explosive damage, shreds armor, and damages cover in an area. Can be used once per mission."
TacticalText="<Bullet/> Firing this weapon ends the soldier's turn, in the absence of special training. Can be used once per mission."
AbilityDescName="micro missile launcher"

[BU_MecArcher_Shoulder_WPN X2WeaponTemplate]
FriendlyName="Micro Missile Artillery Launcher"
FriendlyNamePlural="Micro Missile Artillery Launchers"
BriefSummary="An extremely long-range, shoulder-mounted launcher that deals explosive damage, shreds armor, and damages cover in an area. Can be used three times per mission."
TacticalText="<Bullet/> Firing this weapon ends the soldier's turn, in the absence of special training. Can be used three times per mission."
AbilityDescName="micro missile artillery launcher"

[BU_FrostMEC_Shoulder_WPN X2WeaponTemplate]
FriendlyName="Frost Missile Launcher"
FriendlyNamePlural="Frost Missile Launchers"
BriefSummary="A long-range, shoulder-mounted launcher that deals frost damage, pierces and shreds armor, and damages cover in an area. Inflicts bitterfrost. Can be used twice per mission."
TacticalText="<Bullet/> Firing this weapon ends the soldier's turn, in the absence of special training. Can be used twice per mission."
AbilityDescName="frost missile launcher"

[BU_PrototypeGatlingMEC_Shoulder_WPN X2WeaponTemplate]
FriendlyName="Prototype MEC Gatling Cannon"
FriendlyNamePlural="Prototype MEC Gatling Cannons"
BriefSummary="A gatling cannon for mid to long range engagements that suffers Aim penalties up close. Can be fired in a cone to hit multiple targets, or focused on one to deal shredding and bleeding in addition to damage. Carries more than enough ammo for a mission and does not need to be reloaded in the field."
TacticalText="<Bullet/> Does not benefit from equipped ammo.\n<Bullet/> Shred and bleed do not apply to Gatling Sweep, and Gatling Shot offers +10 extra Aim compared to Gatling Sweep.\n<Bullet/> Can be used to Overwatch, which is typically much more viable than Overwatch with the shotgun.\n<Bullet/> Gatling Shot and Gatling Sweep are both non-turn-ending actions."
AbilityDescName="gatling cannon"

[BU_MilitaryGatlingMEC_Shoulder_WPN X2WeaponTemplate]
FriendlyName="Military MEC Gatling Cannon"
FriendlyNamePlural="Military MEC Gatling Cannons"
BriefSummary="A gatling cannon for mid to long range engagements that suffers Aim penalties up close. Can be fired in a cone to hit multiple targets, or focused on one to deal shredding and bleeding in addition to damage. Carries more than enough ammo for a mission and does not need to be reloaded in the field."
TacticalText="<Bullet/> Does not benefit from equipped ammo.\n<Bullet/> Shred and bleed do not apply to Gatling Sweep, and Gatling Shot offers +10 extra Aim compared to Gatling Sweep.\n<Bullet/> Can be used to Overwatch, which is typically much more viable than Overwatch with the shotgun.\n<Bullet/> Gatling Shot and Gatling Sweep are both non-turn-ending actions."
AbilityDescName="gatling cannon"

[BU_JunkSpark_WPN X2WeaponTemplate]
FriendlyName="Junk Autocannon"
FriendlyNamePlural="Junk Autocannons"
BriefSummary="A cheaply made autocannon with limited stopping power designed specifically for use by our Junk SPARK units. Does not allow for modifications."
TacticalText="<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training."
AbilityDescName="junk autocannon"

[BU_AdventDrone_WPN X2WeaponTemplate]
FriendlyName="Drone Shock Beam"
FriendlyNamePlural="Drone Shock Beams"
BriefSummary="The Advent Drone's Shock Beam, which does only minor damage but can disorient its target. Does not allow for modifications."
TacticalText="<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training."
AbilityDescName="drone shock beam"

[BU_AdventDroneRepair_WPN X2WeaponTemplate]
FriendlyName="Drone Repair Beam"
FriendlyNamePlural="Drone Repair Beams"
BriefSummary="The Advent Drone's Repair Beam, which can heal robotic units for a small amount of HP. It can't repair shredded armor or cure conditions like acid, nor can the drone repair itself with it, but its use is limited only by a cooldown."
TacticalText="<Bullet/> The damage value listed for this weapon is the amount that it heals robotic units for. It doesn't do damage at all."
AbilityDescName="drone repair beam"

[BU_HunterDrone_WPN X2WeaponTemplate]
FriendlyName="Hunter Drone Shock Beam"
FriendlyNamePlural="Hunter Drone Shock Beams"
BriefSummary="The Hunter Drone's Shock Beam, which is a substantial improvement over the standard Drone Shock beam in terms of damage, and can disorient its target. Does not allow for modifications."
TacticalText="<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training."
AbilityDescName="drone shock beam"

[BU_HunterDroneRepair_WPN X2WeaponTemplate]
FriendlyName="Hunter Drone Repair Beam"
FriendlyNamePlural="Hunter Drone Repair Beams"
BriefSummary="The Hunter Drone's Repair Beam, which can heal robotic units for a moderate amount of HP. It can't repair shredded armor or cure conditions like acid, nor can the drone repair itself with it, but its use is limited only by a cooldown."
TacticalText="<Bullet/> The damage value listed for this weapon is the amount that it heals robotic units for. It doesn't do damage at all."
AbilityDescName="drone repair beam"

[BU_EnigmaDrone_WPN X2WeaponTemplate]
FriendlyName="Enigma Drone Shock Beam"
FriendlyNamePlural="Enigma Drone Shock Beams"
BriefSummary="The Enigma Drone's Shock Beam, which is a slight improvement over the standard Drone Shock beam in terms of damage, and can disorient its target. Does not allow for modifications."
TacticalText="<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training. Like other Drone shock beam weapons, this one has a hard range limit, thus it cannot be used with Squadsight."
AbilityDescName="drone shock beam"

[BU_EnigmaDroneRepair_WPN X2WeaponTemplate]
FriendlyName="Enigma Drone Repair Beam"
FriendlyNamePlural="Enigma Drone Repair Beams"
BriefSummary="The Enigma Drone's Repair Beam, which can heal robotic units for a half-decent amount of HP. It can't repair shredded armor or cure conditions like acid, nor can the drone repair itself with it, but its use is limited only by a cooldown."
TacticalText="<Bullet/> The damage value listed for this weapon is the amount that it heals robotic units for. It doesn't do damage at all."
AbilityDescName="drone repair beam"

[BU_CelatidTurretCV_WPN X2WeaponTemplate]
FriendlyName="Celatid Turret Gun"
FriendlyNamePlural="Celatid Turret Guns"
BriefSummary="The Celatid Turret's main weapon. Damage is comparible to a conventional assault rifle, and it does not need to be manually reloaded. Does not allow for modifications."
TacticalText="<Bullet/> Does not need to be manually reloaded in the field. \n<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training."
AbilityDescName="turret gun"

[BU_CelatidTurretMG_WPN X2WeaponTemplate]
FriendlyName="Celatid Turret Mag Gun"
FriendlyNamePlural="Celatid Turret Mag Guns"
BriefSummary="The Alloy Celatid Turret's main weapon. Damage is comparible to a magnetic assault rifle, and it does not need to be manually reloaded. Does not allow for modifications."
TacticalText="<Bullet/> Does not need to be manually reloaded in the field. \n<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training."
AbilityDescName="turret gun"

[BU_CelatidTurretBM_WPN X2WeaponTemplate]
FriendlyName="Celatid Turret Beam Gun"
FriendlyNamePlural="Celatid Turret Beam Guns"
BriefSummary="The Elerium Celatid Turret's main weapon. Damage is comparible to a beam assault rifle, including dealing 1 point of rupture to the target, and it does not need to be manually reloaded. Does not allow for modifications."
TacticalText="<Bullet/> Does not need to be manually reloaded in the field.\n<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training."
AbilityDescName="turret gun"

[BU_PhaseDrone_WPN X2WeaponTemplate]
FriendlyName="Phase Blaster"
FriendlyNamePlural="Phase Blasters"
BriefSummary="The Phase Drone's main weapon. Compared to the main weapon of an Advent Drone, this one doesn't disorient targets, but it does more damage, pierces a bit of armor and can fire as far as the Phase Drone can see. Does not allow for modifications."
TacticalText="<Bullet/> Does not need to be manually reloaded in the field.\n<Bullet/> Firing this weapon ends the soldier's turn, in the absence of special training."
AbilityDescName="phase blaster"

[BU_PhaseDrone_Missile_WPN X2WeaponTemplate]
FriendlyName="Micro Launcher"
FriendlyNamePlural="Micro Launchers"
BriefSummary="The Phase Drone's launcher, which launches a single micro missile. Does not allow for modifications."
TacticalText="<Bullet/> Firing this weapon ends the soldier's turn, in the absence of special training."
AbilityDescName="micro launcher"

[BU_Shiv_WPN X2WeaponTemplate]
FriendlyName="SHIV Gatling Gun"
FriendlyNamePlural="SHIV Gatling Guns"
BriefSummary="The SHIV's main weapon. It fires conventional rounds, and its damage output and effective range are roughly equivalent to our standard infantry cannons. Does not allow for modifications."
TacticalText="<Bullet/> Firing this weapon ends the soldier's turn, in the absence of special training."
AbilityDescName="gatling gun"

[BU_AlloyShiv_WPN X2WeaponTemplate]
FriendlyName="Alloy SHIV Laser Gatling Gun"
FriendlyNamePlural="Alloy SHIV Laser Gatling Guns"
BriefSummary="The Alloy SHIV's main weapon. It is a laser weapon, and its damage output and effective range are roughly equivalent to our infantry laser cannons. Does not allow for modifications."
TacticalText="<Bullet/> Firing this weapon ends the soldier's turn, in the absence of special training."
AbilityDescName="gatling gun"

[BU_EleriumShiv_WPN X2WeaponTemplate]
FriendlyName="Elerium SHIV Coil Gatling Gun"
FriendlyNamePlural="Elerium SHIV Coil Gatling Guns"
BriefSummary="The Elerium SHIV's main weapon. It is a coil weapon, and its damage output and effective range are roughly equivalent to our infantry coil cannons. Does not allow for modifications."
TacticalText="<Bullet/> Firing this weapon ends the soldier's turn, in the absence of special training."
AbilityDescName="gatling gun"

[BU_FrostDroid_Pistol_WPN X2WeaponTemplate]
FriendlyName="Frost Droid Pistol"
FriendlyNamePlural="Frost Droid Pistols"
BriefSummary="The Frost Droid's signature sidearm. Damage is low, but is guaranteed to inflict bitterfrost on a hit. Does not allow for modifications."
TacticalText="<Bullet/> Inflicts bitterfrost on a hit.\n<Bullet/> Cannot benefit from special ammo.\n<Bullet/> Firing the pistol ends the soldier's turn, in the absence of special training."
AbilityDescName="Frost Droid pistol"

[BU_ResistanceMec_Armor X2ArmorTemplate]
FriendlyName="Resistance MEC Armor"
FriendlyNamePlural="Resistance MEC Armors"
BriefSummary="The armor we built onto our Resistance MEC units will make them about as durable as newly constructed SPARK units."
TacticalText="<Bullet/> In order to minimize the number of individual parts, this armor was designed to be non-removable."
AbilityDescName="resistance MEC armor"

[BU_MecPyroclast_Armor X2ArmorTemplate]
FriendlyName="MEC Pyroclast Armor"
FriendlyNamePlural="MEC Pyroclast Armors"
BriefSummary="The MEC Pyroclast has better armor than even the Resistance MEC, a necessity due to its dedicated close combat role."
TacticalText="<Bullet/> In order to minimize the number of individual parts, this armor was designed to be non-removable."
AbilityDescName="MEC pyroclast armor"

[BU_MecArcher_Armor X2ArmorTemplate]
FriendlyName="MEC Archer Armor"
FriendlyNamePlural="MEC Archer Armors"
BriefSummary="This armor isn't that impressive, but the MEC Archer's ability to shell the enemy from extreme range doesn't necessitate better armor."
TacticalText="<Bullet/> In order to minimize the number of individual parts, this armor was designed to be non-removable."
AbilityDescName="MEC archer armor"

[BU_PrototypeGatlingMec_Armor X2ArmorTemplate]
FriendlyName="Prototype Assault MEC Armor"
FriendlyNamePlural="Prototype Assault MEC Armors"
BriefSummary="The Prototype Assault MEC offers impressive durability without sacrificing mobility, and most notably features a hardpoint for mounting its signature gatling cannon."
TacticalText="<Bullet/> In order to minimize the number of individual parts, this armor was designed to be non-removable."
AbilityDescName="prototype assault MEC armor"

[BU_MilitaryGatlingMec_Armor X2ArmorTemplate]
FriendlyName="Military Assault MEC Armor"
FriendlyNamePlural="Military Assault MEC Armors"
BriefSummary="The Military Assault MEC offers peak durability without sacrificing mobility, and most notably features a hardpoint for mounting its signature gatling cannon."
TacticalText="<Bullet/> In order to minimize the number of individual parts, this armor was designed to be non-removable."
AbilityDescName="military assault MEC armor"

[BU_JunkSpark_Armor X2ArmorTemplate]
FriendlyName="Junk SPARK Armor"
FriendlyNamePlural="Junk SPARK Armors"
BriefSummary="The armor featured on the Junk SPARK units is extra thick; a necessity to protect their fragile electronics."
TacticalText="<Bullet/> In order to minimize the number of individual parts, this armor was designed to be non-removable."
AbilityDescName="junk SPARK armor"

[BU_AdventDrone_Armor X2ArmorTemplate]
FriendlyName="Advent Drone Chassis"
FriendlyNamePlural="Advent Drone Chassis"
BriefSummary="The chassis of the Advent Drone is small, but this often makes it harder to target accurately."
TacticalText="<Bullet/> This is the drone's entire chassis; it would be a lot easier to build an entire new drone than try to fiddle with this one further."
AbilityDescName="advent drone chassis"

[BU_HunterDrone_Armor X2ArmorTemplate]
FriendlyName="Hunter Drone Chassis"
FriendlyNamePlural="Hunter Drone Chassis"
BriefSummary="The chassis of the Hunter Drone is small, but this often makes it harder to target accurately."
TacticalText="<Bullet/> This is the drone's entire chassis; it would be a lot easier to build an entire new drone than try to fiddle with this one further."
AbilityDescName="hunter drone chassis"

[BU_EnigmaDrone_Armor X2ArmorTemplate]
FriendlyName="Enigma Drone Chassis"
FriendlyNamePlural="Enigma Drone Chassis"
BriefSummary="The chassis of the Enigma Drone is small, but this often makes it harder to target accurately."
TacticalText="<Bullet/> This is the drone's entire chassis; it would be a lot easier to build an entire new drone than try to fiddle with this one further."
AbilityDescName="enigma drone chassis"

[BU_CelatidTurretCV_Armor X2ArmorTemplate]
FriendlyName="Celatid Turret Body"
FriendlyNamePlural="Celatid Turret Body"
BriefSummary="The bodies of Celatid Turrets are biomechanical, offer better evasion than a MEC and better durability than a Drone."
TacticalText="<Bullet/> The mechanical parts are integrated into the biological parts, even more than a MEC Trooper's. Starting from scratch is a far simpler alternative than trying to operate on this creature."
AbilityDescName="celatid turret body"

[BU_CelatidTurretMG_Armor X2ArmorTemplate]
FriendlyName="Alloy Celatid Turret Body"
FriendlyNamePlural="Alloy Celatid Turret Body"
BriefSummary="The bodies of Alloy Celatid Turrets are biomechanical, offer better evasion than a MEC and better durability than a Drone."
TacticalText="<Bullet/> The mechanical parts are integrated into the biological parts, even more than a MEC Trooper's. Starting from scratch is a far simpler alternative than trying to operate on this creature."
AbilityDescName="alloy celatid turret body"

[BU_CelatidTurretBM_Armor X2ArmorTemplate]
FriendlyName="Elerium Celatid Turret Body"
FriendlyNamePlural="Elerium Celatid Turret Body"
BriefSummary="The bodies of Elerium Celatid Turrets are biomechanical, offer better evasion than a MEC and better durability than a Drone."
TacticalText="<Bullet/> The mechanical parts are integrated into the biological parts, even more than a MEC Trooper's. Starting from scratch is a far simpler alternative than trying to operate on this creature."
AbilityDescName="elerium celatid turret body"

[BU_PhaseDrone_Armor X2ArmorTemplate]
FriendlyName="Phase Drone Chassis"
FriendlyNamePlural="Phase Drone Chassis"
BriefSummary="The chassis of the Phase Drone is small, but this often makes it harder to target accurately."
TacticalText="<Bullet/> This is the drone's entire chassis; it would be a lot easier to build an entire new drone than try to fiddle with this one further."
AbilityDescName="phase drone chassis"

[BU_Shiv_Armor X2ArmorTemplate]
FriendlyName="SHIV Chassis"
FriendlyNamePlural="SHIV Chassis"
BriefSummary="The basic SHIV chassis offers moderate protection."
TacticalText="<Bullet/> This is the SHIV's entire chassis; it would be a lot easier to build an entire new SHIV than try to fiddle with this one further."
AbilityDescName="shiv chassis"

[BU_AlloyShiv_Armor X2ArmorTemplate]
FriendlyName="Alloy SHIV Chassis"
FriendlyNamePlural="Alloy SHIV Chassis"
BriefSummary="The Alloy SHIV chassis offers improved durability compared to the basic model thanks to our Plated Armor technology."
TacticalText="<Bullet/> This is the Alloy SHIV's entire chassis; it would be a lot easier to build an entire new SHIV than try to fiddle with this one further."
AbilityDescName="alloy shiv chassis"

[BU_EleriumShiv_Armor X2ArmorTemplate]
FriendlyName="Elerium SHIV Chassis"
FriendlyNamePlural="Elerium SHIV Chassis"
BriefSummary="The Elerium SHIV chassis offers improved durability compared to the Alloy model thanks to our Powered Armor technology."
TacticalText="<Bullet/> This is the Elerium SHIV's entire chassis; it would be a lot easier to build an entire new SHIV than try to fiddle with this one further."
AbilityDescName="elerium shiv chassis"

[BU_FrostMec_Armor X2ArmorTemplate]
FriendlyName="Frost MEC Armor"
FriendlyNamePlural="Frost MEC Armors"
BriefSummary="The armor we built onto our Frost MEC units will make them about as durable as newly constructed SPARK units."
TacticalText="<Bullet/> In order to minimize the number of individual parts, this armor was designed to be non-removable."
AbilityDescName="frost MEC armor"

[BU_FrostDroid_Armor X2ArmorTemplate]
FriendlyName="Frost Droid Armor"
FriendlyNamePlural="Frost Droid Armors"
BriefSummary="The Frost Droid's armor emphasizes range of motion over durability, as their ability to make use of cover doesn't necessitate anything more durable."
TacticalText="<Bullet/> In order to minimize the number of individual parts, this armor was designed to be non-removable."
AbilityDescName="frost droid armor"

[BU_ResistanceMecClass X2SoldierClassTemplate]
DisplayName="Resistance MEC"
ClassSummary="Comparable in durability and firepower to freshly-built SPARKs, these MEC units can help fill our squads if we're running low on soldiers or new recruits. They can't rank up, hack or interact with most objectives, but they can rescue civilians, mark supply crates and pick up loot drops."
LeftAbilityTreeTitle=""
RightAbilityTreeTitle=""

RankNames[0]="Rookie"
RankNames[1]="Automaton"
RankNames[2]="Automaton"
RankNames[3]="Automaton"
RankNames[4]="Automaton"
RankNames[5]="Automaton"
RankNames[6]="Automaton"
RankNames[7]="Automaton"
RankNames[8]="Automaton"

ShortNames[0]="Rk."
ShortNames[1]="Amt."
ShortNames[2]="Amt."
ShortNames[3]="Amt."
ShortNames[4]="Amt."
ShortNames[5]="Amt."
ShortNames[6]="Amt."
ShortNames[7]="Amt."
ShortNames[8]="Amt."

RankIcons[0]="UILibrary_Common.rank_rookie"
RankIcons[1]="UILibrary_DLC3Images.rank_squire"
RankIcons[2]="UILibrary_DLC3Images.rank_squire"
RankIcons[3]="UILibrary_DLC3Images.rank_squire"
RankIcons[4]="UILibrary_DLC3Images.rank_squire"
RankIcons[5]="UILibrary_DLC3Images.rank_squire"
RankIcons[6]="UILibrary_DLC3Images.rank_squire"
RankIcons[7]="UILibrary_DLC3Images.rank_squire"
RankIcons[8]="UILibrary_DLC3Images.rank_squire"

[BU_MecArcherClass X2SoldierClassTemplate]
DisplayName="MEC Archer"
ClassSummary="MEC units that specialize in long-range bombardment, but aren't as durable as our Resistance MECs. They can't rank up, hack or interact with most objectives, but they can rescue civilians, mark supply crates and pick up loot drops."
LeftAbilityTreeTitle=""
RightAbilityTreeTitle=""

RankNames[0]="Rookie"
RankNames[1]="Automaton"
RankNames[2]="Automaton"
RankNames[3]="Automaton"
RankNames[4]="Automaton"
RankNames[5]="Automaton"
RankNames[6]="Automaton"
RankNames[7]="Automaton"
RankNames[8]="Automaton"

ShortNames[0]="Rk."
ShortNames[1]="Amt."
ShortNames[2]="Amt."
ShortNames[3]="Amt."
ShortNames[4]="Amt."
ShortNames[5]="Amt."
ShortNames[6]="Amt."
ShortNames[7]="Amt."
ShortNames[8]="Amt."

RankIcons[0]="UILibrary_Common.rank_rookie"
RankIcons[1]="UILibrary_DLC3Images.rank_squire"
RankIcons[2]="UILibrary_DLC3Images.rank_squire"
RankIcons[3]="UILibrary_DLC3Images.rank_squire"
RankIcons[4]="UILibrary_DLC3Images.rank_squire"
RankIcons[5]="UILibrary_DLC3Images.rank_squire"
RankIcons[6]="UILibrary_DLC3Images.rank_squire"
RankIcons[7]="UILibrary_DLC3Images.rank_squire"
RankIcons[8]="UILibrary_DLC3Images.rank_squire"

[BU_MecPyroclastClass X2SoldierClassTemplate]
DisplayName="MEC Pyroclast"
ClassSummary="MEC units that are durable, fast and wield a specialized flamethrower with two firing modes. They lack a micro missile launcher or a proper firearm, making them incapable of long range combat. They can't rank up, hack or interact with most objectives, but they can rescue civilians, mark supply crates and pick up loot drops."
LeftAbilityTreeTitle=""
RightAbilityTreeTitle=""

RankNames[0]="Rookie"
RankNames[1]="Automaton"
RankNames[2]="Automaton"
RankNames[3]="Automaton"
RankNames[4]="Automaton"
RankNames[5]="Automaton"
RankNames[6]="Automaton"
RankNames[7]="Automaton"
RankNames[8]="Automaton"

ShortNames[0]="Rk."
ShortNames[1]="Amt."
ShortNames[2]="Amt."
ShortNames[3]="Amt."
ShortNames[4]="Amt."
ShortNames[5]="Amt."
ShortNames[6]="Amt."
ShortNames[7]="Amt."
ShortNames[8]="Amt."

RankIcons[0]="UILibrary_Common.rank_rookie"
RankIcons[1]="UILibrary_DLC3Images.rank_squire"
RankIcons[2]="UILibrary_DLC3Images.rank_squire"
RankIcons[3]="UILibrary_DLC3Images.rank_squire"
RankIcons[4]="UILibrary_DLC3Images.rank_squire"
RankIcons[5]="UILibrary_DLC3Images.rank_squire"
RankIcons[6]="UILibrary_DLC3Images.rank_squire"
RankIcons[7]="UILibrary_DLC3Images.rank_squire"
RankIcons[8]="UILibrary_DLC3Images.rank_squire"

[BU_JunkSparkClass X2SoldierClassTemplate]
DisplayName="Junk SPARK"
ClassSummary="Cheaply-made mechanical units that can bolster our barracks in desperate times. Their fragile innards are protected by thick armor, and they have the ability to self-destruct if the situation calls for it. They can't rank up, hack or interact with most objectives, but they can rescue civilians, mark supply crates and pick up loot drops."
LeftAbilityTreeTitle=""
RightAbilityTreeTitle=""

RankNames[0]="Rookie"
RankNames[1]="Automaton"
RankNames[2]="Automaton"
RankNames[3]="Automaton"
RankNames[4]="Automaton"
RankNames[5]="Automaton"
RankNames[6]="Automaton"
RankNames[7]="Automaton"
RankNames[8]="Automaton"

ShortNames[0]="Rk."
ShortNames[1]="Amt."
ShortNames[2]="Amt."
ShortNames[3]="Amt."
ShortNames[4]="Amt."
ShortNames[5]="Amt."
ShortNames[6]="Amt."
ShortNames[7]="Amt."
ShortNames[8]="Amt."

RankIcons[0]="UILibrary_Common.rank_rookie"
RankIcons[1]="UILibrary_DLC3Images.rank_squire"
RankIcons[2]="UILibrary_DLC3Images.rank_squire"
RankIcons[3]="UILibrary_DLC3Images.rank_squire"
RankIcons[4]="UILibrary_DLC3Images.rank_squire"
RankIcons[5]="UILibrary_DLC3Images.rank_squire"
RankIcons[6]="UILibrary_DLC3Images.rank_squire"
RankIcons[7]="UILibrary_DLC3Images.rank_squire"
RankIcons[8]="UILibrary_DLC3Images.rank_squire"

[BU_AdventDroneClass X2SoldierClassTemplate]
DisplayName="Advent Drone"
ClassSummary="Rebuilt Advent surveillance drones that excel at scouting and impairing single targets. They can't rank up, hack, interact with most objectives, or pick up loot drops, but they can rescue civilians."
LeftAbilityTreeTitle=""
RightAbilityTreeTitle=""

RankNames[0]="Rookie"
RankNames[1]="Automaton"
RankNames[2]="Automaton"
RankNames[3]="Automaton"
RankNames[4]="Automaton"
RankNames[5]="Automaton"
RankNames[6]="Automaton"
RankNames[7]="Automaton"
RankNames[8]="Automaton"

ShortNames[0]="Rk."
ShortNames[1]="Amt."
ShortNames[2]="Amt."
ShortNames[3]="Amt."
ShortNames[4]="Amt."
ShortNames[5]="Amt."
ShortNames[6]="Amt."
ShortNames[7]="Amt."
ShortNames[8]="Amt."

RankIcons[0]="UILibrary_Common.rank_rookie"
RankIcons[1]="UILibrary_DLC3Images.rank_squire"
RankIcons[2]="UILibrary_DLC3Images.rank_squire"
RankIcons[3]="UILibrary_DLC3Images.rank_squire"
RankIcons[4]="UILibrary_DLC3Images.rank_squire"
RankIcons[5]="UILibrary_DLC3Images.rank_squire"
RankIcons[6]="UILibrary_DLC3Images.rank_squire"
RankIcons[7]="UILibrary_DLC3Images.rank_squire"
RankIcons[8]="UILibrary_DLC3Images.rank_squire"

[BU_HunterDroneClass X2SoldierClassTemplate]
DisplayName="Hunter Drone"
ClassSummary="Hunter Drones feature improved durability, damage, and repair capabilities compared to the standard Advent Drone. They excel at scouting and impairing single targets. They can't rank up, hack, interact with most objectives, or pick up loot drops, but they can rescue civilians."
LeftAbilityTreeTitle=""
RightAbilityTreeTitle=""

RankNames[0]="Rookie"
RankNames[1]="Automaton"
RankNames[2]="Automaton"
RankNames[3]="Automaton"
RankNames[4]="Automaton"
RankNames[5]="Automaton"
RankNames[6]="Automaton"
RankNames[7]="Automaton"
RankNames[8]="Automaton"

ShortNames[0]="Rk."
ShortNames[1]="Amt."
ShortNames[2]="Amt."
ShortNames[3]="Amt."
ShortNames[4]="Amt."
ShortNames[5]="Amt."
ShortNames[6]="Amt."
ShortNames[7]="Amt."
ShortNames[8]="Amt."

RankIcons[0]="UILibrary_Common.rank_rookie"
RankIcons[1]="UILibrary_DLC3Images.rank_squire"
RankIcons[2]="UILibrary_DLC3Images.rank_squire"
RankIcons[3]="UILibrary_DLC3Images.rank_squire"
RankIcons[4]="UILibrary_DLC3Images.rank_squire"
RankIcons[5]="UILibrary_DLC3Images.rank_squire"
RankIcons[6]="UILibrary_DLC3Images.rank_squire"
RankIcons[7]="UILibrary_DLC3Images.rank_squire"
RankIcons[8]="UILibrary_DLC3Images.rank_squire"

[BU_EnigmaDroneClass X2SoldierClassTemplate]
DisplayName="Enigma Drone"
ClassSummary="Enigma Drones feature slightly improved durability, damage, and repair capabilities compared to the standard Advent Drone, and are much better at avoiding attacks. They excel at scouting, stealth, and marking enemy targets from Squadsight range to make them easier to hit. They can't rank up, hack, interact with most objectives, or pick up loot drops, but they can rescue civilians."
LeftAbilityTreeTitle=""
RightAbilityTreeTitle=""

RankNames[0]="Rookie"
RankNames[1]="Automaton"
RankNames[2]="Automaton"
RankNames[3]="Automaton"
RankNames[4]="Automaton"
RankNames[5]="Automaton"
RankNames[6]="Automaton"
RankNames[7]="Automaton"
RankNames[8]="Automaton"

ShortNames[0]="Rk."
ShortNames[1]="Amt."
ShortNames[2]="Amt."
ShortNames[3]="Amt."
ShortNames[4]="Amt."
ShortNames[5]="Amt."
ShortNames[6]="Amt."
ShortNames[7]="Amt."
ShortNames[8]="Amt."

RankIcons[0]="UILibrary_Common.rank_rookie"
RankIcons[1]="UILibrary_DLC3Images.rank_squire"
RankIcons[2]="UILibrary_DLC3Images.rank_squire"
RankIcons[3]="UILibrary_DLC3Images.rank_squire"
RankIcons[4]="UILibrary_DLC3Images.rank_squire"
RankIcons[5]="UILibrary_DLC3Images.rank_squire"
RankIcons[6]="UILibrary_DLC3Images.rank_squire"
RankIcons[7]="UILibrary_DLC3Images.rank_squire"
RankIcons[8]="UILibrary_DLC3Images.rank_squire"

[BU_CelatidTurretCVClass X2SoldierClassTemplate]
DisplayName="Celatid Turret"
ClassSummary="Celatid Turrets are biomechanical drone-like creatures that offer solid firepower and survivability relative to their size. Being cyborgs rather than fully robotic, they can be affected by Psionics and most mental ailments, and their armor doesn't cover enough of their body to protect them from fire. They can't rank up, hack or interact with most objectives, but they can rescue civilians, mark supply crates and pick up loot drops."
LeftAbilityTreeTitle=""
RightAbilityTreeTitle=""

RankNames[0]="Rookie"
RankNames[1]="Cyborg"
RankNames[2]="Cyborg"
RankNames[3]="Cyborg"
RankNames[4]="Cyborg"
RankNames[5]="Cyborg"
RankNames[6]="Cyborg"
RankNames[7]="Cyborg"
RankNames[8]="Cyborg"

ShortNames[0]="Rk."
ShortNames[1]="Cbg."
ShortNames[2]="Cbg."
ShortNames[3]="Cbg."
ShortNames[4]="Cbg."
ShortNames[5]="Cbg."
ShortNames[6]="Cbg."
ShortNames[7]="Cbg."
ShortNames[8]="Cbg."

RankIcons[0]="UILibrary_Common.rank_rookie"
RankIcons[1]="UILibrary_DLC3Images.rank_squire"
RankIcons[2]="UILibrary_DLC3Images.rank_squire"
RankIcons[3]="UILibrary_DLC3Images.rank_squire"
RankIcons[4]="UILibrary_DLC3Images.rank_squire"
RankIcons[5]="UILibrary_DLC3Images.rank_squire"
RankIcons[6]="UILibrary_DLC3Images.rank_squire"
RankIcons[7]="UILibrary_DLC3Images.rank_squire"
RankIcons[8]="UILibrary_DLC3Images.rank_squire"

[BU_CelatidTurretMGClass X2SoldierClassTemplate]
DisplayName="Alloy Celatid Turret"
ClassSummary="Alloy Celatid Turrets improve upon the previous incarnation's firepower and survivability thanks to our development of magnetic weapons and plated armor. Being cyborgs rather than fully robotic, they can be affected by Psionics and most mental ailments, and their armor doesn't cover enough of their body to protect them from fire. They can't rank up, hack or interact with most objectives, but they can rescue civilians, mark supply crates and pick up loot drops."
LeftAbilityTreeTitle=""
RightAbilityTreeTitle=""

RankNames[0]="Rookie"
RankNames[1]="Cyborg"
RankNames[2]="Cyborg"
RankNames[3]="Cyborg"
RankNames[4]="Cyborg"
RankNames[5]="Cyborg"
RankNames[6]="Cyborg"
RankNames[7]="Cyborg"
RankNames[8]="Cyborg"

ShortNames[0]="Rk."
ShortNames[1]="Cbg."
ShortNames[2]="Cbg."
ShortNames[3]="Cbg."
ShortNames[4]="Cbg."
ShortNames[5]="Cbg."
ShortNames[6]="Cbg."
ShortNames[7]="Cbg."
ShortNames[8]="Cbg."

RankIcons[0]="UILibrary_Common.rank_rookie"
RankIcons[1]="UILibrary_DLC3Images.rank_squire"
RankIcons[2]="UILibrary_DLC3Images.rank_squire"
RankIcons[3]="UILibrary_DLC3Images.rank_squire"
RankIcons[4]="UILibrary_DLC3Images.rank_squire"
RankIcons[5]="UILibrary_DLC3Images.rank_squire"
RankIcons[6]="UILibrary_DLC3Images.rank_squire"
RankIcons[7]="UILibrary_DLC3Images.rank_squire"
RankIcons[8]="UILibrary_DLC3Images.rank_squire"

[BU_CelatidTurretBMClass X2SoldierClassTemplate]
DisplayName="Elerium Celatid Turret"
ClassSummary="Elerium Celatid Turrets improve upon the previous incarnation's firepower and survivability thanks to our development of beam weapons and powered armor. Being cyborgs rather than fully robotic, they can be affected by Psionics and most mental ailments, and their armor doesn't cover enough of their body to protect them from fire. They can't rank up, hack or interact with most objectives, but they can rescue civilians, mark supply crates and pick up loot drops."
LeftAbilityTreeTitle=""
RightAbilityTreeTitle=""

RankNames[0]="Rookie"
RankNames[1]="Cyborg"
RankNames[2]="Cyborg"
RankNames[3]="Cyborg"
RankNames[4]="Cyborg"
RankNames[5]="Cyborg"
RankNames[6]="Cyborg"
RankNames[7]="Cyborg"
RankNames[8]="Cyborg"

ShortNames[0]="Rk."
ShortNames[1]="Cbg."
ShortNames[2]="Cbg."
ShortNames[3]="Cbg."
ShortNames[4]="Cbg."
ShortNames[5]="Cbg."
ShortNames[6]="Cbg."
ShortNames[7]="Cbg."
ShortNames[8]="Cbg."

RankIcons[0]="UILibrary_Common.rank_rookie"
RankIcons[1]="UILibrary_DLC3Images.rank_squire"
RankIcons[2]="UILibrary_DLC3Images.rank_squire"
RankIcons[3]="UILibrary_DLC3Images.rank_squire"
RankIcons[4]="UILibrary_DLC3Images.rank_squire"
RankIcons[5]="UILibrary_DLC3Images.rank_squire"
RankIcons[6]="UILibrary_DLC3Images.rank_squire"
RankIcons[7]="UILibrary_DLC3Images.rank_squire"
RankIcons[8]="UILibrary_DLC3Images.rank_squire"

[BU_PhaseDroneClass X2SoldierClassTemplate]
DisplayName="Phase Drone"
ClassSummary="An exotic Drone variant equipped with a blaster and a single micro missile, which also has the ability to mark targets. Their primary standout feature, however, is their ability to phase through solid walls. They can't rank up, hack, interact with most objectives, or pick up loot drops, but they can rescue civilians."
LeftAbilityTreeTitle=""
RightAbilityTreeTitle=""

RankNames[0]="Rookie"
RankNames[1]="Automaton"
RankNames[2]="Automaton"
RankNames[3]="Automaton"
RankNames[4]="Automaton"
RankNames[5]="Automaton"
RankNames[6]="Automaton"
RankNames[7]="Automaton"
RankNames[8]="Automaton"

ShortNames[0]="Rk."
ShortNames[1]="Amt."
ShortNames[2]="Amt."
ShortNames[3]="Amt."
ShortNames[4]="Amt."
ShortNames[5]="Amt."
ShortNames[6]="Amt."
ShortNames[7]="Amt."
ShortNames[8]="Amt."

RankIcons[0]="UILibrary_Common.rank_rookie"
RankIcons[1]="UILibrary_DLC3Images.rank_squire"
RankIcons[2]="UILibrary_DLC3Images.rank_squire"
RankIcons[3]="UILibrary_DLC3Images.rank_squire"
RankIcons[4]="UILibrary_DLC3Images.rank_squire"
RankIcons[5]="UILibrary_DLC3Images.rank_squire"
RankIcons[6]="UILibrary_DLC3Images.rank_squire"
RankIcons[7]="UILibrary_DLC3Images.rank_squire"
RankIcons[8]="UILibrary_DLC3Images.rank_squire"

[BU_ShivClass X2SoldierClassTemplate]
DisplayName="SHIV"
ClassSummary="The Super Heavy Infantry Vehicle, or the SHIV, is a relic from the first war. Despite their age, we were able to make them compatible with our basic GREMLINs, which they can use to boost allies' defense and scan for enemies. They can't rank up, hack, interact with most objectives, or pick up loot drops, but they can rescue civilians."
LeftAbilityTreeTitle=""
RightAbilityTreeTitle=""

RankNames[0]="Rookie"
RankNames[1]="Automaton"
RankNames[2]="Automaton"
RankNames[3]="Automaton"
RankNames[4]="Automaton"
RankNames[5]="Automaton"
RankNames[6]="Automaton"
RankNames[7]="Automaton"
RankNames[8]="Automaton"

ShortNames[0]="Rk."
ShortNames[1]="Amt."
ShortNames[2]="Amt."
ShortNames[3]="Amt."
ShortNames[4]="Amt."
ShortNames[5]="Amt."
ShortNames[6]="Amt."
ShortNames[7]="Amt."
ShortNames[8]="Amt."

RankIcons[0]="UILibrary_Common.rank_rookie"
RankIcons[1]="UILibrary_DLC3Images.rank_squire"
RankIcons[2]="UILibrary_DLC3Images.rank_squire"
RankIcons[3]="UILibrary_DLC3Images.rank_squire"
RankIcons[4]="UILibrary_DLC3Images.rank_squire"
RankIcons[5]="UILibrary_DLC3Images.rank_squire"
RankIcons[6]="UILibrary_DLC3Images.rank_squire"
RankIcons[7]="UILibrary_DLC3Images.rank_squire"
RankIcons[8]="UILibrary_DLC3Images.rank_squire"

[BU_AlloyShivClass X2SoldierClassTemplate]
DisplayName="Alloy SHIV"
ClassSummary="The Alloy SHIV is a straight upgrade to the original, offering better durability, firepower and the ability to act as full cover for our soldiers. Its capabilities with the basic GREMLIN are also improved. They can't rank up, hack, interact with most objectives, or pick up loot drops, but they can rescue civilians."
LeftAbilityTreeTitle=""
RightAbilityTreeTitle=""

RankNames[0]="Rookie"
RankNames[1]="Automaton"
RankNames[2]="Automaton"
RankNames[3]="Automaton"
RankNames[4]="Automaton"
RankNames[5]="Automaton"
RankNames[6]="Automaton"
RankNames[7]="Automaton"
RankNames[8]="Automaton"

ShortNames[0]="Rk."
ShortNames[1]="Amt."
ShortNames[2]="Amt."
ShortNames[3]="Amt."
ShortNames[4]="Amt."
ShortNames[5]="Amt."
ShortNames[6]="Amt."
ShortNames[7]="Amt."
ShortNames[8]="Amt."

RankIcons[0]="UILibrary_Common.rank_rookie"
RankIcons[1]="UILibrary_DLC3Images.rank_squire"
RankIcons[2]="UILibrary_DLC3Images.rank_squire"
RankIcons[3]="UILibrary_DLC3Images.rank_squire"
RankIcons[4]="UILibrary_DLC3Images.rank_squire"
RankIcons[5]="UILibrary_DLC3Images.rank_squire"
RankIcons[6]="UILibrary_DLC3Images.rank_squire"
RankIcons[7]="UILibrary_DLC3Images.rank_squire"
RankIcons[8]="UILibrary_DLC3Images.rank_squire"

[BU_EleriumShivClass X2SoldierClassTemplate]
DisplayName="Elerium SHIV"
ClassSummary="The Elerium SHIV is a straight upgrade to the Alloy variant, offering better durability, firepower and a regenerating shield. Its capabilities with the basic GREMLIN are also improved. They can't rank up, hack, interact with most objectives, or pick up loot drops, but they can rescue civilians."
LeftAbilityTreeTitle=""
RightAbilityTreeTitle=""

RankNames[0]="Rookie"
RankNames[1]="Automaton"
RankNames[2]="Automaton"
RankNames[3]="Automaton"
RankNames[4]="Automaton"
RankNames[5]="Automaton"
RankNames[6]="Automaton"
RankNames[7]="Automaton"
RankNames[8]="Automaton"

ShortNames[0]="Rk."
ShortNames[1]="Amt."
ShortNames[2]="Amt."
ShortNames[3]="Amt."
ShortNames[4]="Amt."
ShortNames[5]="Amt."
ShortNames[6]="Amt."
ShortNames[7]="Amt."
ShortNames[8]="Amt."

RankIcons[0]="UILibrary_Common.rank_rookie"
RankIcons[1]="UILibrary_DLC3Images.rank_squire"
RankIcons[2]="UILibrary_DLC3Images.rank_squire"
RankIcons[3]="UILibrary_DLC3Images.rank_squire"
RankIcons[4]="UILibrary_DLC3Images.rank_squire"
RankIcons[5]="UILibrary_DLC3Images.rank_squire"
RankIcons[6]="UILibrary_DLC3Images.rank_squire"
RankIcons[7]="UILibrary_DLC3Images.rank_squire"
RankIcons[8]="UILibrary_DLC3Images.rank_squire"

[BU_FrostMecClass X2SoldierClassTemplate]
DisplayName="Frost MEC"
ClassSummary="A MEC unit specializing in the application of bitterfrost, particularly via suppressing targets. Their damage is modest but they have solid durability. They can't rank up, hack or interact with most objectives, but they can rescue civilians, mark supply crates and pick up loot drops."
LeftAbilityTreeTitle=""
RightAbilityTreeTitle=""

RankNames[0]="Rookie"
RankNames[1]="Automaton"
RankNames[2]="Automaton"
RankNames[3]="Automaton"
RankNames[4]="Automaton"
RankNames[5]="Automaton"
RankNames[6]="Automaton"
RankNames[7]="Automaton"
RankNames[8]="Automaton"

ShortNames[0]="Rk."
ShortNames[1]="Amt."
ShortNames[2]="Amt."
ShortNames[3]="Amt."
ShortNames[4]="Amt."
ShortNames[5]="Amt."
ShortNames[6]="Amt."
ShortNames[7]="Amt."
ShortNames[8]="Amt."

RankIcons[0]="UILibrary_Common.rank_rookie"
RankIcons[1]="UILibrary_DLC3Images.rank_squire"
RankIcons[2]="UILibrary_DLC3Images.rank_squire"
RankIcons[3]="UILibrary_DLC3Images.rank_squire"
RankIcons[4]="UILibrary_DLC3Images.rank_squire"
RankIcons[5]="UILibrary_DLC3Images.rank_squire"
RankIcons[6]="UILibrary_DLC3Images.rank_squire"
RankIcons[7]="UILibrary_DLC3Images.rank_squire"
RankIcons[8]="UILibrary_DLC3Images.rank_squire"

[BU_FrostDroidClass X2SoldierClassTemplate]
DisplayName="Frost Droid"
ClassSummary="The Frost Droid is a particularly versatile robot that can wield our human soldiers' primary weapons and serve different roles in battle depending on which one they equip. Additionally carries its signature pistol which can apply bitterfrost on a hit. They can't rank up, hack or interact with most objectives, but they can rescue civilians, mark supply crates, carry unconscious units, make use of cover, hunker down and pick up loot drops."
LeftAbilityTreeTitle=""
RightAbilityTreeTitle=""

RankNames[0]="Rookie"
RankNames[1]="Automaton"
RankNames[2]="Automaton"
RankNames[3]="Automaton"
RankNames[4]="Automaton"
RankNames[5]="Automaton"
RankNames[6]="Automaton"
RankNames[7]="Automaton"
RankNames[8]="Automaton"

ShortNames[0]="Rk."
ShortNames[1]="Amt."
ShortNames[2]="Amt."
ShortNames[3]="Amt."
ShortNames[4]="Amt."
ShortNames[5]="Amt."
ShortNames[6]="Amt."
ShortNames[7]="Amt."
ShortNames[8]="Amt."

RankIcons[0]="UILibrary_Common.rank_rookie"
RankIcons[1]="UILibrary_DLC3Images.rank_squire"
RankIcons[2]="UILibrary_DLC3Images.rank_squire"
RankIcons[3]="UILibrary_DLC3Images.rank_squire"
RankIcons[4]="UILibrary_DLC3Images.rank_squire"
RankIcons[5]="UILibrary_DLC3Images.rank_squire"
RankIcons[6]="UILibrary_DLC3Images.rank_squire"
RankIcons[7]="UILibrary_DLC3Images.rank_squire"
RankIcons[8]="UILibrary_DLC3Images.rank_squire"

[BU_PrototypeGatlingMecClass X2SoldierClassTemplate]
DisplayName="Prototype Assault MEC"
ClassSummary="Equipped with heavy armor as well as a shotgun for close range and a gatling cannon for mid to long range, these MEC units rival a SPARK with Magnetic and Alloy based equipment when it comes to combat. They can't rank up, hack or interact with most objectives, but they can rescue civilians, mark supply crates and pick up loot drops."
LeftAbilityTreeTitle=""
RightAbilityTreeTitle=""

RankNames[0]="Rookie"
RankNames[1]="Automaton"
RankNames[2]="Automaton"
RankNames[3]="Automaton"
RankNames[4]="Automaton"
RankNames[5]="Automaton"
RankNames[6]="Automaton"
RankNames[7]="Automaton"
RankNames[8]="Automaton"

ShortNames[0]="Rk."
ShortNames[1]="Amt."
ShortNames[2]="Amt."
ShortNames[3]="Amt."
ShortNames[4]="Amt."
ShortNames[5]="Amt."
ShortNames[6]="Amt."
ShortNames[7]="Amt."
ShortNames[8]="Amt."

RankIcons[0]="UILibrary_Common.rank_rookie"
RankIcons[1]="UILibrary_DLC3Images.rank_squire"
RankIcons[2]="UILibrary_DLC3Images.rank_squire"
RankIcons[3]="UILibrary_DLC3Images.rank_squire"
RankIcons[4]="UILibrary_DLC3Images.rank_squire"
RankIcons[5]="UILibrary_DLC3Images.rank_squire"
RankIcons[6]="UILibrary_DLC3Images.rank_squire"
RankIcons[7]="UILibrary_DLC3Images.rank_squire"
RankIcons[8]="UILibrary_DLC3Images.rank_squire"

[BU_MilitaryGatlingMecClass X2SoldierClassTemplate]
DisplayName="Military Assault MEC"
ClassSummary="Equipped with heavy armor as well as a shotgun for close range and a gatling cannon for mid to long range, these MEC units rival a SPARK with Beam and Elerium based equipment when it comes to combat. They can't rank up, hack or interact with most objectives, but they can rescue civilians, mark supply crates and pick up loot drops."
LeftAbilityTreeTitle=""
RightAbilityTreeTitle=""

RankNames[0]="Rookie"
RankNames[1]="Automaton"
RankNames[2]="Automaton"
RankNames[3]="Automaton"
RankNames[4]="Automaton"
RankNames[5]="Automaton"
RankNames[6]="Automaton"
RankNames[7]="Automaton"
RankNames[8]="Automaton"

ShortNames[0]="Rk."
ShortNames[1]="Amt."
ShortNames[2]="Amt."
ShortNames[3]="Amt."
ShortNames[4]="Amt."
ShortNames[5]="Amt."
ShortNames[6]="Amt."
ShortNames[7]="Amt."
ShortNames[8]="Amt."

RankIcons[0]="UILibrary_Common.rank_rookie"
RankIcons[1]="UILibrary_DLC3Images.rank_squire"
RankIcons[2]="UILibrary_DLC3Images.rank_squire"
RankIcons[3]="UILibrary_DLC3Images.rank_squire"
RankIcons[4]="UILibrary_DLC3Images.rank_squire"
RankIcons[5]="UILibrary_DLC3Images.rank_squire"
RankIcons[6]="UILibrary_DLC3Images.rank_squire"
RankIcons[7]="UILibrary_DLC3Images.rank_squire"
RankIcons[8]="UILibrary_DLC3Images.rank_squire"

[MarkTarget X2AbilityTemplate]
LocFriendlyName="Mark Target"
LocLongDescription="Mark a target, making it easier to focus fire on that target. Any attack against the marked target has a bonus to Aim."
LocHelpText="Mark an enemy target. Allies gain extra Aim when attacking the target."
LocPromotionPopupText="<Bullet/> Mark Target can be used at Squadsight range if the user has the Squadsight ability. It will not break concealment when used.<br/>"

[BU_ChargeServos X2AbilityTemplate]
LocFriendlyName="Charge Servos"
LocLongDescription="Spend 2 action points to gain 3 movement-only action points. 1 turn cooldown."
LocHelpText="Spend 2 action points to gain 3 movement-only action points. 1 turn cooldown."
LocFlyOverText="Charge Servos"
LocPromotionPopupText="<Bullet/> Charge Servos is not only great for getting the <Ability:ClassName/> closer to the enemy or to an obscured position for a flanking attack next turn, but also for marking supply crates or rescuing civilians.\n<Bullet/> Can be used every other turn.\n<Bullet/> Remember: after you activate this ability, the <Ability:ClassName/> won't be able to attack for the remainder of this turn."

[BU_MecInferno X2AbilityTemplate]
LocFriendlyName="Fire Flame Projector"
LocLongDescription="Spray a large amount of fire in a cone-shaped area. Can be fired without ending the turn."
LocHelpText="Spray a large amount of fire in a cone-shaped area."
LocFlyOverText="Fire Flame Projector"
LocPromotionPopupText="<Bullet/> Be careful using the Flame Projector near objectives, as the fire can spread. Fire can also destroy timed loot and corpse drops if it kills the target through direct damage, but not with damage over time effects. Will not end the turn if used as your first action."

[BU_MecInfernoPhosphorus X2AbilityTemplate]
LocFriendlyName="Phosphorus Meltdown"
LocLongDescription="Fire an overwhelmingly hot blast that shreds armor, ruptures and isn't stopped by fire immunity, but does not ignite targets or terrain."
LocHelpText="Fire an overwhelmingly hot blast that isn't stopped by fire immunity."
LocFlyOverText="Phosphorus Meltdown"
LocPromotionPopupText="<Bullet/> Incorporates gauss weapon tech and phosphorus to create a mixture that deals high damage, even to robots and other fire-immune units, as well as shredding a point of armor and dealing a point of rupture. This particular mixture will not ignite targets or terrain.\n<Bullet/> Requires more ammo, has a smaller area of effect, and ends the MEC Pyroclast's turn when used.\n<Bullet/> The heat from this attack is so powerful that it will always destroy loot. Has to cool down for a turn between uses to avoid melting the weapon itself."

[CelatidImmunities X2AbilityTemplate]
LocFriendlyName="Celatid Immunities"
LocLongDescription="Immune to poison, Chryssalid poison and stun."
LocHelpText="Immune to poison, Chryssalid poison and stun."
LocFlyOverText="Immune"

[BU_TurretPersistence X2AbilityTemplate]
LocFriendlyName="Turret Persistence"
LocLongDescription="When on Overwatch, if your shot misses, another shot will be taken at the next eligible target."
LocHelpText="When on Overwatch, if your shot misses, another shot will be taken at the next eligible target."
LocFlyOverText="Turret Persistence"
LocPromotionPopupText="<Bullet/> Shots will continue to be taken until a hit is made or there are no more targets to shoot at. Each target will only be fired upon once.\n<Bullet/> Critical hits and grazes both are considered \"hits\" for the purposes of this ability.\n<Bullet/> Only affects regular Overwatch; Return Fire and similar abilities that grant other kinds of reaction shots are unaffected.\n<Bullet/> This unit won't continue to make Overwatch shot attempts if its Overwatch is removed, e.g. by taking damage, being suppressed or becoming disoriented."

[Bulwark X2AbilityTemplate]
LocFriendlyName="Bulwark"
LocLongDescription="Gain a bonus point of Armor, and always provide high cover to all adjacent squadmates."
LocHelpText="Gain a bonus point of Armor, and always provide high cover to all adjacent squadmates."
LocPromotionPopupText="<Bullet/> Bulwark adds one point of Armor.<br/><Bullet/> Any squadmate standing adjacent to the <Ability:ClassName/> will gain the high cover Defense bonus.<br/>"

[shivshielden X2AbilityTemplate]
LocFriendlyName="Automend Shield"
LocLongDescription="Gives the <Ability:ClassName/> a 3 HP regenerating shield which refills at the start of your turn."
LocHelpText="Gives the <Ability:ClassName/> a 3 HP regenerating shield which refills at the start of your turn."
LocFlyOverText="Automend Shield"
LocPromotionPopupText="Gives the <Ability:ClassName/> a 3 HP regenerating shield which refills at the start of your turn."

[FrostMecImmunities X2AbilityTemplate]
LocFriendlyName="Frost MEC Immunities"
LocLongDescription="The <Ability:ClassName/> is immune to frost, poison, Chryssalid poison, and knockback. Unlike a typical robot, they are not immune to fire."
LocHelpText="The <Ability:ClassName/> is immune to frost, poison, Chryssalid poison, and knockback. Unlike a typical robot, they are not immune to fire."
LocFlyOverText="Frost MEC Immunities"

[FrostDroidImmunities X2AbilityTemplate]
LocFriendlyName="Frost Droid Immunities"
LocLongDescription="The <Ability:ClassName/> is immune to frost, poison, and Chryssalid poison. Unlike a typical robot, they are not immune to fire."
LocHelpText="The <Ability:ClassName/> is immune to frost, poison, and Chryssalid poison. Unlike a typical robot, they are not immune to fire."
LocFlyOverText="Frost Droid Immunities"

[BU_AllPurpose X2AbilityTemplate]
LocFriendlyName="All-Purpose"
LocLongDescription="Grants the <Ability:ClassName/> different abilities during a mission based on which primary weapon type they have equipped."
LocHelpText="Grants the <Ability:ClassName/> different abilities during a mission based on which primary weapon type they have equipped."
LocFlyOverText="All-Purpose"
LocPromotionPopupText="<Bullet/> Equipping an Assault Rifle grants Target Focus and Maim.<br/><Bullet/> Equipping an SMG grants Predator and Flush.<br/><Bullet/> Equipping a Shotgun grants Impulse and Slug Shot.<br/><Bullet/> Equipping a Cannon grants Suppression and Area Suppression.<br/><Bullet/> Equipping a Sniper Rifle grants Squadsight and Holo Targeting.<br/><Bullet/> Equipping a Chemthrower grants Open Fire and Chemthrower Suppression."